Revit 2027 API
Document.NewSpace Method
 Creates a new space.
Overload List
Name | Description
NewSpace(Phase) |  Creates a new unplaced space on a given phase.
NewSpace(Level, UV) | Creates a new space element on the given level at the given location.
NewSpace(Level, Phase, UV) | Creates a new space element on the given level, at the given location, and assigned to the given phase.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace